# One hot Encoding and Get_dummies

In [4]:
import numpy as np
import pandas as pd

In [19]:
df=pd.read_csv("covid_toy.csv")

In [21]:
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [23]:
df=df.drop(columns = ['age' , 'fever'])

In [25]:
df.head(3)

  gender cough     city has_covid
0   Male  Mild  Kolkata        No
1   Male  Mild    Delhi       Yes
2   Male  Mild    Delhi        No

In [29]:
from sklearn.preprocessing import OneHotEncoder

In [31]:
ohe = OneHotEncoder(drop = 'first' , sparse_output = False , dtype = np.int32)

In [33]:
df_new = ohe.fit_transform(df[['gender' , 'cough' , 'city' , 'has_covid']])

In [35]:
df_new

array([[1, 0, 0, 1, 0, 0],
       [1, 0, 1, 0, 0, 1],
       [1, 0, 1, 0, 0, 0],
       [0, 0, 0, 1, 0, 0],
       [0, 0, 0, 0, 1, 0],
       [0, 0, 0, 0, 0, 1],
       [1, 1, 0, 0, 0, 0],
       [0, 1, 0, 0, 1, 1],
       [0, 1, 0, 0, 0, 0],
       [0, 0, 1, 0, 0, 0],
       [0, 0, 1, 0, 0, 0],
       [0, 0, 0, 0, 1, 1],
       [0, 1, 0, 1, 0, 0],
       [1, 0, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 0],
       [1, 1, 0, 1, 0, 1],
       [0, 0, 0, 1, 0, 1],
       [0, 1, 1, 0, 0, 0],
       [0, 0, 0, 0, 0, 1],
       [0, 1, 0, 0, 0, 1],
       [1, 1, 0, 0, 0, 0],
       [1, 0, 0, 0, 0, 1],
       [0, 1, 0, 1, 0, 1],
       [0, 0, 1, 0, 0, 1],
       [0, 1, 0, 1, 0, 0],
       [1, 0, 0, 0, 1, 0],
       [0, 0, 0, 1, 0, 1],
       [0, 1, 1, 0, 0, 0],
       [1, 0, 0, 1, 0, 0],
       [0, 1, 0, 0, 1, 1],
       [1, 0, 1, 0, 0, 1],
       [1, 0, 0, 1, 0, 0],
       [0, 1, 1, 0, 0, 1],
       [0, 0, 0, 1, 0, 0],
       [1, 0, 0, 0, 1, 1],
       [0, 1, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0],
       [1, 0, 0, 1, 0, 0],
       [0, 0, 1, 0, 0, 1],
       [0, 0, 0, 1, 0, 0],
       [0, 0, 1, 0, 0, 0],
       [1, 0, 0, 1, 0, 1],
       [1, 0, 1, 0, 0, 1],
       [0, 0, 0, 0, 0, 1],
       [1, 1, 1, 0, 0, 0],
       [1, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 1, 0],
       [0, 0, 0, 0, 0, 0],
       [1, 1, 0, 0, 0, 0],
       [1, 0, 0, 0, 1, 0],
       [1, 0, 1, 0, 0, 1],
       [0, 1, 0, 1, 0, 1],
       [0, 1, 0, 0, 0, 1],
       [1, 0, 1, 0, 0, 1],
       [0, 0, 0, 0, 1, 1],
       [0, 0, 0, 0, 1, 1],
       [1, 1, 0, 1, 0, 0],
       [0, 1, 0, 0, 0, 0],
       [1, 1, 0, 0, 1, 1],
       [0, 0, 0, 1, 0, 1],
       [0, 1, 0, 0, 0, 1],
       [0, 1, 0, 0, 1, 0],
       [0, 1, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 0],
       [1, 0, 0, 0, 1, 0],
       [0, 0, 0, 0, 0, 0],
       [1, 0, 0, 1, 0, 0],
       [1, 0, 0, 0, 0, 0],
       [0, 1, 0, 1, 0, 0],
       [0, 0, 1, 0, 0, 0],
       [0, 1, 1, 0, 0, 0],
       [0, 1, 1, 0, 0, 0],
       [0, 0, 0, 1, 0, 0],
       [1, 1, 0, 1, 0, 1],
       [0, 1, 1, 0, 0, 0],
       [1, 0, 0, 1, 0, 1],
       [1, 0, 0, 0, 0, 1],
       [0, 0, 0, 1, 0, 0],
       [1, 0, 0, 0, 0, 1],
       [0, 0, 0, 1, 0, 1],
       [0, 0, 0, 0, 1, 1],
       [1, 0, 1, 0, 0, 0],
       [1, 0, 0, 1, 0, 1],
       [0, 0, 0, 1, 0, 0],
       [0, 1, 0, 0, 1, 0],
       [0, 0, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 1],
       [1, 1, 0, 0, 0, 0],
       [0, 0, 0, 1, 0, 0],
       [1, 1, 0, 0, 0, 0],
       [0, 1, 1, 0, 0, 0],
       [1, 0, 1, 0, 0, 1],
       [0, 1, 0, 1, 0, 0],
       [1, 0, 0, 1, 0, 1],
       [1, 1, 0, 1, 0, 1],
       [0, 0, 0, 0, 0, 0],
       [0, 1, 0, 1, 0, 1],
       [0, 0, 0, 0, 0, 0],
       [0, 1, 0, 0, 1, 0],
       [0, 1, 0, 1, 0, 1]])

In [39]:
# df.head(3)

In [41]:
# gender----->2
# cough----->2
# city-------->4
# has_covid---->2

In [43]:
# get_dummies

In [47]:
df_new = pd.get_dummies(df , drop_first = True , columns = ['gender' , 'cough' , 'city' , 'has_covid'])

In [49]:
df_new.astype(int)

,gender_Male,cough_Strong,city_Delhi,city_Kolkata,city_Mumbai,has_covid_Yes
0,1,0,0,1,0,0
1,1,0,1,0,0,1
2,1,0,1,0,0,0
3,0,0,0,1,0,0
4,0,0,0,0,1,0
...,...,...,...,...,...,...
95,0,0,0,0,0,0
96,0,1,0,1,0,1
97,0,0,0,0,0,0
98,0,1,0,0,1,0
99,0,1,0,1,0,1

In [51]:
# Data 
# (1). Categorical data:- We can not divide further.
# (2). Numerical data:- We can divide further.

In [53]:
# Normal Distribution------> Data mean centroid .
# from left side , right side equal data points .
# Standrdization -------> Mean centroid (mean = 0 , std = 1)
# Normalization  -------> Min_value = 0 , Max_value = 1

# Label encoding

In [271]:
df=pd.read_csv("insurance.csv")

In [273]:
df.head(3)

   age     sex    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523
2   28    male  33.00         3     no  southeast   4449.4620

In [274]:
df.region

0       southwest
1       southeast
2       southeast
3       northwest
4       northwest
          ...
1333    northwest
1334    northeast
1335    southeast
1336    southwest
1337    northwest
Name: region, Length: 1338, dtype: object

In [275]:
# df.isnull().sum()

In [276]:
from sklearn.preprocessing import LabelEncoder

In [277]:
lb = LabelEncoder()

In [278]:
df['sex'] = lb.fit_transform(df['sex'])
df['smoker'] = lb.fit_transform(df['smoker'])
df['region'] = lb.fit_transform(df['region'])

In [279]:
df.head(3)

   age  sex    bmi  children  smoker  region     charges
0   19    0  27.90         0       1       3  16884.9240
1   18    1  33.77         1       0       2   1725.5523
2   28    1  33.00         3       0       2   4449.4620

In [280]:
x = df.drop(columns = ['charges'])
y = df['charges']

In [281]:
from sklearn.model_selection import train_test_split

In [282]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [283]:
from sklearn.preprocessing import MinMaxScaler

In [284]:
mn = MinMaxScaler()

In [285]:
x_train_mn = mn.fit_transform(x_train)

In [286]:
x_train_new = pd.DataFrame(x_train_mn , columns = x_train.columns)

In [287]:
np.round(x_train_new.describe() , 2)

           age      sex      bmi  children   smoker   region
count  1070.00  1070.00  1070.00   1070.00  1070.00  1070.00
mean      0.46     0.51     0.39      0.22     0.21     0.50
std       0.31     0.50     0.16      0.24     0.40     0.37
min       0.00     0.00     0.00      0.00     0.00     0.00
25%       0.20     0.00     0.28      0.00     0.00     0.33
50%       0.47     1.00     0.38      0.20     0.00     0.67
75%       0.72     1.00     0.50      0.40     0.00     0.67
max       1.00     1.00     1.00      1.00     1.00     1.00

# Ordinal Encoding

In [289]:
df=pd.read_csv('insurance.csv')

In [290]:
df.head(3)

   age     sex    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523
2   28    male  33.00         3     no  southeast   4449.4620

In [291]:
df=df.drop(columns = ['age' , 'bmi' , 'children' , 'charges'])

In [292]:
df.head(3)

      sex smoker     region
0  female    yes  southwest
1    male     no  southeast
2    male     no  southeast

In [293]:
df['region'].value_counts()

region
southeast    364
southwest    325
northwest    325
northeast    324
Name: count, dtype: int64

In [294]:
from sklearn.preprocessing import OrdinalEncoder

In [295]:
oe = OrdinalEncoder( categories = [['male' , 'female'],
                                  ['yes' , 'no'],
                                  ['southeast' , 'southwest' , 'northwest' , 'northeast']])

In [296]:
oe_sc = oe.fit_transform(df)

In [297]:
new_df = pd.DataFrame(oe_sc , columns = df.columns)

In [298]:
new_df.head(3)

   sex  smoker  region
0  1.0     0.0     1.0
1  0.0     1.0     0.0
2  0.0     1.0     0.0

In [299]:
new_df = new_df.astype(int)
new_df

      sex  smoker  region
0       1       0       1
1       0       1       0
2       0       1       0
3       0       1       2
4       0       1       2
...   ...     ...     ...
1333    0       1       2
1334    1       1       3
1335    1       1       0
1336    1       1       1
1337    1       0       2

[1338 rows x 3 columns]

# OneHot Encoding

In [301]:
df=pd.read_csv('insurance.csv')

In [302]:
df.head(2)

   age     sex    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523

In [303]:
df=df.drop(columns = ['age' , 'bmi' , 'children' , 'charges'])

In [304]:
df.head(2)

      sex smoker     region
0  female    yes  southwest
1    male     no  southeast

In [305]:
ohe = OneHotEncoder(drop = 'first' , sparse_output = False , dtype = np.int32)

In [306]:
df_new = ohe.fit_transform(df[['sex' , 'smoker' , 'region']])

In [307]:
df_new

array([[0, 1, 0, 0, 1],
       [1, 0, 0, 1, 0],
       [1, 0, 0, 1, 0],
       ...,
       [0, 0, 0, 1, 0],
       [0, 0, 0, 0, 1],
       [0, 1, 1, 0, 0]])

# Get_Dummies

In [309]:
df_new = pd.get_dummies(df , drop_first = True , columns = ['sex' , 'smoker' , 'region'])

In [310]:
df_new.astype(int)

,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,0,1,0,0,1
1,1,0,0,1,0
2,1,0,0,1,0
3,1,0,1,0,0
4,1,0,1,0,0
...,...,...,...,...,...
1333,1,0,1,0,0
1334,0,0,0,0,0
1335,0,0,0,1,0
1336,0,0,0,0,1
1337,0,1,1,0,0

# Standardization

In [312]:
from sklearn.preprocessing import StandardScaler

In [313]:
sc = StandardScaler()

In [314]:
df_new.head(3)

   sex_male  smoker_yes  region_northwest  region_southeast  region_southwest
0     False        True             False             False              True
1      True       False             False              True             False
2      True       False             False              True             False

In [315]:
x_train_sc = sc.fit_transform(x_train)

In [316]:
x_train_new = pd.DataFrame(x_train_sc , columns = x_train.columns)  
type(x_train_new)

pandas.core.frame.DataFrame

In [317]:
np.round(x_train_new.describe() , 2)

           age      sex      bmi  children   smoker   region
count  1070.00  1070.00  1070.00   1070.00  1070.00  1070.00
mean     -0.00    -0.00    -0.00     -0.00     0.00    -0.00
std       1.00     1.00     1.00      1.00     1.00     1.00
min      -1.52    -1.02    -2.42     -0.91    -0.51    -1.35
25%      -0.88    -1.02    -0.72     -0.91    -0.51    -0.46
50%       0.01     0.98    -0.06     -0.09    -0.51     0.44
75%       0.83     0.98     0.65      0.73    -0.51     0.44
max       1.75     0.98     3.74      3.20     1.97     1.34